# MultipleValuesCustomText Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..MultipleValuesCustomText Property
ScheduleField Class See Also
---
The custom multiple values text to be used when the schedule field displays multiple element values, used when MultipleValuesDisplayType is set to Custom.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public string MultipleValuesCustomText { get; set; }
```

Visual Basic
---
```text
Public Property MultipleValuesCustomText As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ MultipleValuesCustomText {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace